USE restaurants;
CREATE TABLE `restaurants` (
  `id` INT NOT NULL AUTO_INCREMENT,
  `name` VARCHAR(255) NOT NULL,
  `address` VARCHAR(255) NOT NULL,
  `hours` VARCHAR(255),
  `latitude` DOUBLE NOT NULL,
  `longitude` DOUBLE NOT NULL,
  PRIMARY KEY (`id`)
);


-- 카페 데이터 추가
INSERT INTO restaurants (name, address, hours, latitude, longitude)
VALUES 
  ('오프커스', '부산시 부산진구 전포대로199번길 30 중림빌딩 1층 102호', '11:00~22:30', 35.15475887030011, 129.06364157668318),
  ('랑데자뷰', '부산 부산진구 서전로10번길 64', '11:00~23:00', 35.15504823466968, 129.05974536613147),
  ('옵포드', '부산 부산진구 중앙대로680번가길 38 1, 2층', '10:00~23:00', 35.15511188357054, 129.061036258868),
  ('커피를 탐하다', '부산 부산진구 중앙대로680번가길 34 2~4층', '11:00~24:00', 35.154820496859465, 129.06108102702908),
  ('와피쉐', '부산 부산진구 중앙대로692번길 19 1층', '11:00~22:30', 35.154553899935514, 129.0603309078613),
  ('리슨페이지', '부산 연제구 중앙천로73번길 4 1층', '12:00~24:00', 35.188195386428205, 129.1068611353227),
  ('사이먼커피', '부산 연제구 중앙대로1056번길 2 1층', '11:00~22:00', 35.18233588483862, 129.0790908533906),
  ('구자윤과자점 연산점', '부산 연제구 쌍미천로156번길 1', '08:00~22:30', 35.1909819817249, 129.0837049027877),
  ('호시노아 오브 수월경화', '부산 연제구 쌍미천로 82 1층', '11:00~20:00', 35.18006021599842, 129.08852983217116),
  ('슬릭', '부산 연제구 신촌로 5 1층', '11:00~21:00', 35.18202770013442, 129.07762041728034);

-- 한식 데이터 추가
INSERT INTO restaurants (name, address, hours, latitude, longitude)
VALUES 
  ('솥이랑', '부산 부산진구 중앙대로 672 삼정타워 6층 602호', '11:00~21:00', 35.15299802200412, 129.05961686665876),
  ('정을 담다', '부산 부산진구 중앙대로692번길 38', '11:00 ~ 24:00', 35.154329259555475, 129.06121950549803),
  ('시골밥상', '부산 부산진구 가야대로784번길 46-9', NULL, 35.15528531803885, 129.05666527481097),
  ('대독장', '부산 부산진구 서전로 25 이오스프라자 2층', NULL, 35.15578367103088, 129.05756661567779),
  ('올드맨션', '부산 부산진구 서전로 25 이오스프라자 2층', NULL, 35.15515566738035, 129.06415359992724),
  ('한다솥', '부산 부산진구 중앙대로 680', NULL, 35.18444372172224, 129.07966594555378),
  ('청담', '부산 연제구 중앙대로1058번길 10', NULL, 35.188195386428205, 129.1068611353227),
  ('경주박가국밥', '부산 연제구 쌍미천로 62', NULL, 35.184362137927465, 129.10744269813273),
  ('고담', '부산 연제구 중앙대로 690', NULL, 35.187374973889, 129.08554472257578),
  ('고등어다찌', '부산 연제구 쌍미천로 56', NULL, 35.18762711907871, 129.08607806284482);

-- 중식 데이터 추가
INSERT INTO restaurants (name, address, hours, latitude, longitude)
VALUES 
  ('춘화짜장면', '부산 부산진구 중앙대로691번가길 24-5 1층', NULL, 35.155474470909006, 129.05587451489666),
  ('수수반점', '부산 부산진구 중앙대로680번가길 5 2층', NULL, 35.15367530832801, 129.0607257028737),
  ('룽위엔', '부산 부산진구 전포대로199번길 40-7 1층', NULL, 35.15478274258734, 129.06290152847026),
  ('한성각', '부산 부산진구 동천로 32', NULL, 35.1514254104381, 129.06253421934034),
  ('보배반점', '부산 부산진구 부전로66번길 40 1층', NULL, 35.15569806270763, 129.05690335121062),
  ('그집짬뽕0927', '부산 연제구 중앙대로1068번길 16', NULL, 35.177996554335984, 129.06224508328566),
  ('메이리 대한민국 조리기능장의집', '부산 연제구 중앙대로1092번길 21', NULL, 35.180268755848175, 129.0728559520898),
  ('춘리마라탕', '부산 연제구 중앙대로1094번길 31', NULL, 35.18676782696865, 129.08286182437217),
  ('취원', '부산 연제구 중앙대로1112번길 9', NULL, 35.18382053209657, 129.07488901156563),
  ('취원', '부산 연제구 중앙대로1112번길 9', NULL, 35.18382053209657, 129.07488901156563);

-- 양식 데이터 추가
INSERT INTO restaurants (name, address, hours, latitude, longitude)
VALUES 
  ('음주양식당 오스트리아 오브', '부산 부산진구 동천로 58 1층', NULL, 35.153984825540135, 129.06252751569335),
  ('3파운드', '부산 부산진구 전포대로189번길 30 1층 103호', NULL, 35.15359850676482, 129.06351625531323),
  ('EU 피자&파스타 서면', '부산 부산진구 중앙대로680번가길 29 1층', NULL, 35.15359850676482, 129.06351625531323),
  ('이재모피자', '부산 부산진구 전포대로209번길 21 1~3층', NULL, 35.15528903676763, 129.06399512302343),
  ('디퀄리타', '부산 부산진구 서전로9번길 6 1층', NULL, 35.15800300933478, 129.06073338179002),
  ('골든리지', '부산 연제구 중앙대로1118번길 2', NULL, 35.188195386428205, 129.1068611353227),
  ('믹스토랑', '부산 연제구 중앙대로1132번길 21', NULL, 35.18307676133778, 129.0756960732207),
  ('담잔느', '부산 연제구 중앙대로1144번길 22', NULL, 35.180692668967076, 129.10754550244476),
  ('뚜뚜이', '부산 연제구 중앙대로1156번길 7', NULL, 35.17681939083092, 129.0770735081412),
  ('연산명당', '부산 연제구 중앙대로1170번길 13', NULL, 35.17937114507171, 129.08485174717777);

-- 일식 데이터 추가
INSERT INTO restaurants (name, address, hours, latitude, longitude)
VALUES 
  ('송정호 일식', '부산 부산진구 서전로10번길 98부산 부산진구 서면문화로5번길 33 1층', NULL, 35.15820079680833, 129.05572367293814),
  ('야스마루', '부산 부산진구 중앙대로756번길 24', NULL, 35.156025632070204, 129.06439778206737),
  ('마마돈', '부산 부산진구 전포대로209번길 39-9 1층', NULL, 35.155037698351535, 129.0631438788291),
  ('후라토식당', '부산 부산진구 서면로 65-4 1층', NULL, 35.15660918667527, 129.05751059964317),
  ('장승진 스시', '부산 부산진구 서전로10번길 7', NULL, 35.15729651957387, 129.06081157104632),
('대가참치', '부산시 부산진구 Some Address', NULL, 35.18172145489043, 129.07642993449875),
('류센소', '부산시 부산진구 Some Address', NULL, 35.18674373698379, 129.0811186313371),
('정성다이닝', '부산시 부산진구 Some Address', NULL, 35.18131504168427, 129.0762192789262),
('원카츠', '부산시 부산진구 Some Address', NULL, 35.184498540473065, 129.07935999865148);

SELECT * FROM restaurants;


DELETE FROM restaurants;


ALTER TABLE restaurants
ADD COLUMN category VARCHAR(255);

-- 한식 음식점 업데이트
UPDATE restaurants
SET category = '한식'
WHERE name IN ('솥이랑', '정을 담다', '시골밥상', '대독장', '올드맨션', '한다솥', '청담', '경주박가국밥', '고담', '고등어다찌');

-- 중식 음식점 업데이트
UPDATE restaurants
SET category = '중식'
WHERE name IN ('춘화짜장면', '수수반점', '룽위엔', '한성각', '보배반점', '그집짬뽕0927', '메이리 대한민국 조리기능장의집', '춘리마라탕', '취원');

-- 일식 음식점 업데이트
UPDATE restaurants
SET category = '일식'
WHERE name IN ('송정호 일식', '야스마루', '마마돈', '후라토식당', '장승진 스시', '대가참치', '류센소', '정성다이닝', '원카츠');

-- 양식 음식점 업데이트
UPDATE restaurants
SET category = '양식'
WHERE name IN ('음주양식당 오스트리아 오브', '3파운드', 'EU 피자&파스타 서면', '이재모피자', '디퀄리타', '골든리지', '믹스토랑', '담잔느', '뚜뚜이', '연산명당');

-- 카페 업데이트
UPDATE restaurants
SET category = '카페'
WHERE name IN ('오프커스', '랑데자뷰', '옵포드', '커피를탐하다', '와피쉐', '리슨페이지', '사이먼커피', '구자윤과자점 연산', '호시노아 오브 수월경화', '슬릭');


SELECT * FROM restaurants WHERE category = '한식';

SELECT * FROM restaurants WHERE category = '카페';

SELECT * FROM restaurants WHERE category = '일식';

SELECT * FROM restaurants WHERE category = '중식';

INSERT INTO restaurants (name, address, hours, latitude, longitude, category)
VALUES ('이치에', '부산 [부산의 주소]', '[영업시간]', 35.18486498101805, 129.10845180770502, '일식');

UPDATE restaurants
SET category = '카페'
WHERE id = 140;


USE restaurants;

-- 리뷰 테이블 생성
CREATE TABLE IF NOT EXISTS `reviews` (
  `id` INT NOT NULL AUTO_INCREMENT,
  `restaurant_id` INT NOT NULL,
  `rating` INT NOT NULL,
  `comment` TEXT,
  PRIMARY KEY (`id`),
  FOREIGN KEY (`restaurant_id`) REFERENCES `restaurants`(`id`)
);

-- 몇 개의 리뷰 추가
INSERT INTO reviews (restaurant_id, rating, comment)
VALUES 
  (140, 3, '그냥 그래요'),
  (140, 5, '정말 좋아요.'),
  (140, 3, '맛은 괜찮은 편이에요.'),
  (140, 5, '서비스가 훌륭합니다.'),
  (140, 4, '커피가 맛있어요.'),
  (140, 3, '음료가 다양해요.'),
  (140, 5, '분위기가 좋고, 디저트가 맛있습니다.'),
  (140, 4, '좋아요!'),
  (140, 5, '분위기가 좋아요.'),
  (140, 3, '맛은 괜찮은 편이에요.'),
  (140, 5, '서비스가 훌륭합니다.');
SELECT id FROM restaurants;
SELECT DISTINCT restaurant_id FROM reviews WHERE restaurant_id NOT IN (SELECT id FROM restaurants);

SET foreign_key_checks = 0;

-- 여기에 리뷰 추가 쿼리 작성

SET foreign_key_checks = 1;

-- 추가한 음식점의 ID 확인
SELECT id FROM restaurants WHERE name = '이치에';

-- 리뷰에 음식점 ID 추가
INSERT INTO reviews (restaurant_id, rating, comment)
VALUES 
  (1, 4, '맛있어요!'),
  (1, 5, '분위기가 좋아요.');
  
  -- 모든 음식점의 id를 가져옵니다.
SELECT id FROM restaurants;


  